benchmarks/gpt-oss-cpu/results/p5/TP4/rand_1k_128_c1.log
/home/sysadmin/pramod/bench/.venv/bin/vllm bench serve --backend vllm --model gpt-oss-20b --tokenizer /home/sysadmin/pramod/bench/models/gpt-oss-20b --port 8100 --seed 0 --disable-tqdm --save-result --result-dir /home/sysadmin/pramod/bench/results/p5/TP4 --result-filename rand_1k_128_c1.json --percentile-metrics ttft,tpot,itl,e2el --metric-percentiles 50,90,99 --dataset-name random --random-input-len 1024 --random-output-len 128 --ignore-eos --max-concurrency 1 --num-prompts 8 --metadata config=TP4 workload=rand_1k_128 serve_extra=
WARNING 09-25 09:39:20 [importing.py:45] Triton is installed, but doesn't include CPU backend. Disabling Triton.
INFO 09-25 09:39:20 [importing.py:74] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-25 09:39:20 [importing.py:98] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71b461300360>, trust_remote_code=False, seed=0, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', header=None, max_concurrency=1, model='gpt-oss-20b', input_len=None, output_len=None, tokenizer='/home/sysadmin/pramod/bench/models/gpt-oss-20b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=TP4', 'workload=rand_1k_128', 'serve_extra='], result_dir='/home/sysadmin/pramod/bench/results/p5/TP4', result_filename='rand_1k_128_c1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-16bb1aa4-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-25 09:39:23 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  13.48     
Total input tokens:                      8192      
Total generated tokens:                  1024      
Request throughput (req/s):              0.59      
Output token throughput (tok/s):         75.98     
Peak output token throughput (tok/s):    84.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          683.85    
---------------Time to First Token----------------
Mean TTFT (ms):                          165.65    
Median TTFT (ms):                        163.02    
P50 TTFT (ms):                           163.02    
P90 TTFT (ms):                           173.15    
P99 TTFT (ms):                           185.96    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.96     
Median TPOT (ms):                        11.96     
P50 TPOT (ms):                           11.96     
P90 TPOT (ms):                           11.98     
P99 TPOT (ms):                           11.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.96     
Median ITL (ms):                         11.90     
P50 ITL (ms):                            11.90     
P90 ITL (ms):                            12.41     
P99 ITL (ms):                            13.08     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1684.34   
Median E2EL (ms):                        1682.08   
P50 E2EL (ms):                           1682.08   
P90 E2EL (ms):                           1690.42   
P99 E2EL (ms):                           1703.05   
==================================================