benchmarks/gpt-oss-cpu/results/p5/TP4/rand_2k_128_c32.log
/home/sysadmin/pramod/bench/.venv/bin/vllm bench serve --backend vllm --model gpt-oss-20b --tokenizer /home/sysadmin/pramod/bench/models/gpt-oss-20b --port 8100 --seed 0 --disable-tqdm --save-result --result-dir /home/sysadmin/pramod/bench/results/p5/TP4 --result-filename rand_2k_128_c32.json --percentile-metrics ttft,tpot,itl,e2el --metric-percentiles 50,90,99 --dataset-name random --random-input-len 2048 --random-output-len 128 --ignore-eos --max-concurrency 32 --num-prompts 128 --metadata config=TP4 workload=rand_2k_128 serve_extra=
WARNING 09-25 09:43:48 [importing.py:45] Triton is installed, but doesn't include CPU backend. Disabling Triton.
INFO 09-25 09:43:48 [importing.py:74] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-25 09:43:48 [importing.py:98] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x79bfed52c360>, trust_remote_code=False, seed=0, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', header=None, max_concurrency=32, model='gpt-oss-20b', input_len=None, output_len=None, tokenizer='/home/sysadmin/pramod/bench/models/gpt-oss-20b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=TP4', 'workload=rand_2k_128', 'serve_extra='], result_dir='/home/sysadmin/pramod/bench/results/p5/TP4', result_filename='rand_2k_128_c32.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-39a605d8-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-25 09:43:51 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  48.27     
Total input tokens:                      262144    
Total generated tokens:                  16384     
Request throughput (req/s):              2.65      
Output token throughput (tok/s):         339.41    
Peak output token throughput (tok/s):    960.00    
Peak concurrent requests:                38.00     
Total token throughput (tok/s):          5769.93   
---------------Time to First Token----------------
Mean TTFT (ms):                          1993.17   
Median TTFT (ms):                        1494.07   
P50 TTFT (ms):                           1494.07   
P90 TTFT (ms):                           5293.09   
P99 TTFT (ms):                           8007.28   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          78.92     
Median TPOT (ms):                        84.27     
P50 TPOT (ms):                           84.27     
P90 TPOT (ms):                           86.64     
P99 TPOT (ms):                           91.64     
---------------Inter-token Latency----------------
Mean ITL (ms):                           78.92     
Median ITL (ms):                         34.59     
P50 ITL (ms):                            34.59     
P90 ITL (ms):                            265.01    
P99 ITL (ms):                            502.54    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          12015.72  
Median E2EL (ms):                        11972.30  
P50 E2EL (ms):                           11972.30  
P90 E2EL (ms):                           16000.82  
P99 E2EL (ms):                           18889.22  
==================================================